app/Controllers/Categorias.php

    public function index($activo = 1)
    {
        $categorias = $this->categorias->where('activo',$activo)->findAll();
---
SELECT *
FROM `categorias`
WHERE `activo` = 1