app/Controllers/Clientes.php

SELECT *
FROM `clientes`
WHERE `activo` = 1
---
    public function index($activo = 1)
    {
        $clientes = $this->clientes->where('activo',$activo)->findAll();

UPDATE `clientes` SET `activo` = 0, `fecha_edit` = '2023-01-02 16:19:00'
WHERE `clientes`.`id` IN ('8')
---
    public function eliminar($id)
    {
        $this->clientes->update($id, ['activo' => 0]);