app/Controllers/Compras.php

    public function index($activo = 1)
    {
        $compras = $this->compras->where('activo',$activo)->findAll();
---
SELECT *
FROM `compras`
WHERE `activo` = 1