app/Controllers/Usuarios.php

    public function index($activo = 1)
    {
        $usuarios = $this->usuarios->where('activo',$activo)->findAll();
---
SELECT *
FROM `usuarios`
WHERE `activo` = 1